Revit 2027 API
BuiltInFailures.FamilyFailures.SlantedColumnEndPlanesHaveFlipped Property
 Position of end cut planes has resulted in a slanted column without any geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlantedColumnEndPlanesHaveFlipped { get; }
Public Shared ReadOnly Property SlantedColumnEndPlanesHaveFlipped As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlantedColumnEndPlanesHaveFlipped {
	FailureDefinitionId^ get ();
}
static member SlantedColumnEndPlanesHaveFlipped : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace